simulations/unorganized/small_timestep_smallgrid2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          350;
        startFace       753610;
    }
    outlet
    {
        type            patch;
        nFaces          350;
        startFace       753960;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1920;
        startFace       754310;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1080;
        startFace       756230;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1080;
        startFace       757310;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          756000;
        startFace       758390;
    }
)

// ************************************************************************* //
